app/views/ducats/_index.html.erb

<ul class="ducats">
  <% @ducats   = Ducat.all %>
---
SELECT "ducats".* FROM "ducats"