app/controllers/ducats_controller.rb

SELECT  "ducats".* FROM "ducats" WHERE "ducats"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def show
      @ducat = Ducat.find(params[:id])

SELECT  "ducats".* FROM "ducats" WHERE "ducats"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def edit
      @ducat = Ducat.find(params[:id])

INSERT INTO "ducats" ("name", "material", "mint", "set", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "монета"], ["material", ""], ["mint", ""], ["set", ""], ["description", ""], ["created_at", "2017-05-22 11:09:50.919128"], ["updated_at", "2017-05-22 11:09:50.919128"]]
---
    def create
      @ducat = Ducat.new(ducat_params)    # Not the final implementation!
      if @ducat.save