app/controllers/users_controller.rb

    def update
      # @user = User.find(params[:id])
      if @user.update_attributes(user_params)
---
UPDATE "users" SET "password_digest" = ?, "house_number" = ?, "pavilion_number" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$gyb8FC2RiH2hdCUC8lczp.bjBlHRtHNtdpjx6A/ZE3iOmoWRPwXZe"], ["house_number", ""], ["pavilion_number", "1"], ["updated_at", "2017-05-19 11:11:52.203617"], ["id", 1]]